/**/
"Cancel" = "Anuluj";
/**/
"Delete" = "Usuń";
/**/
"Open" = "Otwórz";
/**/
"Edit" = "Edytuj";
/**/
"Yes" = "Tak";
/**/
"Finish" = "Zakończ";
/**/
"Done" = "Zakończono";
/**/
"Save" = "Zapisz";
/**/
"Undo" = "Cofnij";
/**/
"Redo" = "Ponów";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Tak, usuń";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Zastosuj geometrię";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Wyczyść geometrię";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Usuń wierzchołek";
/*Geometry Edit Action Name*/
"Insert Part" = "Wstaw część";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Wstaw wierzchołek";
/*Geometry Edit Action Name*/
"Move Vertex" = "Przesuń wierzchołek";
/*Geometry Edit Action Name*/
"Remove Part" = "Usuń część";

/*Collecting attachments*/
"Add" = "Dodaj";
/*Collecting attachments*/
"Take Photo or Video" = "Zrób zdjęcie lub film";
/*Collecting attachments*/
"Choose From Library" = "Wybierz z biblioteki";
/*Collecting attachments*/
"Photo" = "Zdjęcie";
/*Collecting attachments*/
"Video" = "Wideo";
/*Collecting attachments*/
"Save To Photo Library" = "Zapisz w bibliotece zdjęć";
/*Collecting attachments*/
"Download" = "Pobierz";

/*Date attribute*/
"Today" = "Dzisiaj";

/**/
"Attachments" = "Załączniki";
"Attributes" = "Atrybuty";

/**/
"Open in Safari" = "Otwórz w przeglądarce Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Wprowadź liczbę z przedziału od %i do %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Wprowadź liczbę z przedziału od %@ do %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Za dużo znaków (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Liczba znajduje się poza dozwolonym zakresem.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Nieobsługiwany typ pliku";

/**/
"%d of %d" = "%d z %d";

/**/
"Changing Feature Type" = "Zmiana typu obiektu";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Zmieniasz typ obiektu, co może potencjalnie spowodować nadpisanie wartości pewnych pól. Czy na pewno chcesz to zrobić?";

/**/
"Deleting Feature" = "Usuwanie obiektu";
"Are you sure you want to delete this feature?" = "Czy na pewno chcesz usunąć ten obiekt?";

/**/
"Data for pie chart is invalid" = "Dane do diagramu kołowego są niepoprawne";
"No data to create a pie chart" = "Brak danych do utworzenia diagramu kołowego";
"No image to display" = "Brak obrazu do wyświetlenia";

/**/
"Created by %@ seconds ago" = "Utworzono przez %@ kilka sekund temu";

/**/
"Created by %@ a minute ago" = "Utworzono przez %@ minutę temu";

/**/
"Edited by %@ seconds ago" = "Zmodyfikowano przez %@ kilka sekund temu";

/**/
"Edited by %@ a minute ago" = "Zmodyfikowano przez %@ minutę temu";

/**/
"Created seconds ago" = "Utworzono kilka sekund temu";

/**/
"Created a minute ago" = "Utworzono minutę temu";

/**/
"Edited seconds ago" = "Zmodyfikowano kilka sekund temu";

/**/
"Edited a minute ago" = "Zmodyfikowano minutę temu";

/**/
"Created by %@ %d minutes ago" = "Utworzono przez %@ %d min temu";

/**/
"Created by %@ an hour ago" = "Utworzono przez %@ godzinę temu";

/**/
"Created by %@ %d hours ago" = "Utworzono przez %@ %d h temu";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Utworzono przez %@ dnia %@ o godz. %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Utworzono przez %@ dnia %@ o godz. %@";

/**/
"Edited by %@ %d minutes ago" = "Zmodyfikowano przez %@ %d min temu";

/**/
"Edited by %@ an hour ago" = "Zmodyfikowano przez %@ godzinę temu";

/**/
"Edited by %@ %d hours ago" = "Zmodyfikowano przez %@ %d h temu";

/**/
"Edited by %@ on %@ at %@ - day" = "Zmodyfikowano przez %@ dnia %@ o godz. %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Zmodyfikowano przez %@ dnia %@ o godz. %@";

/**/
"Created by %@" = "Utworzono przez %@";

/**/
"Edited by %@" = "Zmodyfikowano przez %@";

/**/
"Created %d minutes ago" = "Utworzono %d min temu";

/**/
"Created an hour ago" = "Utworzono godzinę temu";

/**/
"Created %d hours ago" = "Utworzono %d h temu";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Utworzono dnia %@ o godz. %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Utworzono dnia %@ o godz. %@";

/**/
"Edited %d minutes ago" = "Zmodyfikowano %d min temu";

/**/
"Edited an hour ago" = "Zmodyfikowano godzinę temu";

/**/
"Edited %d hours ago" = "Zmodyfikowano %d h temu";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Zmodyfikowano dnia %@ o godz. %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Zmodyfikowano dnia %@ o godz. %@";

/* Used to denote a required field */
"Required" = "Wymagane";

/* Used for naming layers with no names */
"Layer %d" = "Warstwa %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Nie można znaleźć adresu lokalizacji";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Nie można znaleźć lokalizacji adresu";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Nie można odczytać adresu";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Nie znaleziono pliku";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Nie można wczytać lokalizatora";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Błąd wewnętrzny lokalizatora";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Lokalizator nie obsługuje geokodowania skrzyżowań";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Nieprawidłowe właściwości lokalizatora";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Brak wymaganego pola";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Lokalizator niezainicjowany";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Nieobsługiwany format lokalizatora";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Nieobsługiwana transformacja odwzorowania";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Nieobsługiwane odniesienie przestrzenne";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Lokator nie obsługuje geokodowania odwrotnego.";

/* Network analyst errors */
"Cannot open network." = "Nie można otworzyć sieci.";
"Cannot retrieve route task parameters." = "Nie można pobrać parametrów zadania wyznaczania tras.";
"Insufficient number of stops." = "Niewystarczająca liczba przystanków.";
"Stop (%@) was not located." = "Przystanek (%@) nie został zlokalizowany.";
"Stop (%@) is located on a non traversable element." = "Przystanek (%@) znajduje się w elemencie, przez który nie można przejść.";
"Stop (%@) is located on a soft restricted element." = "Przystanek (%@) znajduje się w elemencie ograniczonym programowo.";
"Point barrer (%@) was not located." = "Bariera punktu (%@) nie została zlokalizowana.";
"Point barrier (%@) has invalid added cost attribute name." = "Bariera punktu (%@) ma nieprawidłową nazwę atrybutu kosztu dodanego.";
"Line barrier (%@) has invalid scaled cost attribute name." = "Bariera linii (%@) ma nieprawidłową nazwę atrybutu kosztu skalowanego.";
"Line barrier (%@) does not cover any network elements." = "Bariera linii (%@) nie obejmuje żadnych elementów sieci.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Bariera poligonu (%@) ma nieprawidłową nazwę atrybutu kosztu skalowanego.";
"Polygon barrier (%@) does not cover any network elements." = "Bariera poligonu (%@) nie obejmuje żadnych elementów sieci.";
"'%@' is an invalid impedance attribute." = "'%@' jest nieprawidłowym atrybutem impedancji.";
"'%@' restriction attribute is invalid." = "'%@'jest nieprawidłowym atrybutem ograniczenia.";
"'%@' accumulate attribute is invalid." = "'%@'jest nieprawidłowym atrybutem gromadzenia.";
"'%@' is an invalid directions time attribute." = "'%@' jest nieprawidłowym atrybutem czasu trasy.";
"Directions distance attribute is invalid." = "Atrybut odległości trasy jest nieprawidłowy.";
"Invalid attribute parameter attribute name (%@)." = "Nieprawidłowa nazwa atrybutu parametru atrybutu (%@).";
"Invalid attribute parameter parameter name (%@)." = "Nieprawidłowy parametr atrybutu nazwa parametru (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Nieprawidłowy typ wartości parametru (%2$@) atrybutu (%1$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Nieprawidłowa wartość użycia ograniczenia parametru (%2$@) atrybutu (%1$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Neutralna wartość użycia ograniczenia parametru (%2$@) atrybutu (%1$@).";
"Soft restricted element (%@) was traversed." = "Dokonano przejścia elementu ograniczonego programowo (%@).";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Sieć nie ma atrybutu hierarchii niezbędnego do hierarchicznego planowania tras.";
"No path can be found between a given pair of stops (%@)." = "Nie można znaleźć ścieżki między określoną parą przystanków (%@).";
"The input spatial reference is undefined." = "Wejściowe odniesienie przestrzenne jest niezdefiniowane.";
"The output spatial reference is undefined." = "Wynikowe odniesienie przestrzenne jest niezdefiniowane.";
"The directions style is invalid." = "Styl trasy jest nieprawidłowy.";
"The directions language is invalid." = "Język trasy jest nieprawidłowy.";
"Directions time and distance attributes do not match." = "Atrybuty czasu i odległości trasy są niezgodne.";
"The directions road class attribute is invalid." = "Atrybut klasy drogi trasy jest nieprawidłowy.";
"Unknown condition." = "Nieznany warunek.";
"Invalid route task parameters." = "Nieprawidłowe parametry zadania wyznaczania trasy.";
"Route task's solution cannot be found." = "Nie można znaleźć rozwiązania zadania wyznaczania trasy.";
"Route task was cancelled." = "Zadanie wyznaczania trasy zostało anulowane.";
"Route task internal error." = "Błąd wewnętrzny zadania wyznaczania trasy.";
"Route name property is not supported for local route task." = "Właściwość nazwy trasy jest nieobsługiwana w przypadku lokalnego zadania wyznaczania trasy.";
"Local route task parameters should be retrieved from route task." = "Parametry lokalnego zadania wyznaczania trasy należy pobrać z zadania wyznaczania trasy.";
"Cannot retrieve network description." = "Nie można pobrać opisu sieci.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "W przypadku parametrów impedanceAttributeName i accumulateAttributeNames można określić tylko jeden atrybut długości.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "W przypadku parametrów impedanceAttributeName i accumulateAttributeNames można określić tylko jeden atrybut czasu.";
"Service not supported." = "Usługa jest nieobsługiwana.";
"Specified start time occurs before January 1, 1970." = "Podany czas rozpoczęcia to data przed 1stycznia 1970 r.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "Dla przystanku (%@) określono czas rozpoczęcia będący datą przed 1 stycznia 1970 r.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "Dla przystanku (%@) określono lokalne okno czasowe, które rozpoczyna się przed 1 stycznia 1970 r.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Dla przystanku (%@) określono okno czasowe w formacie UTC, które rozpoczyna się przed 1 stycznia 1970 r.";
"Stop (%@) has a time window end that occurs before its time window start." = "Dla przystanku (%@) określono okno czasowe, którego czas zakończenia jest wcześniejszy niż rozpoczęcia.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "DD";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "Mm";
"pt" = "pkt";
"Unknown" = "Nieznane";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Centymetry";
"Decimal Degrees" = "Stopnie dziesiętne";
"Decimeters" = "Decymetry";
"Feet" = "Stopy";
"Inches" = "Cale";
"Kilometers" = "Kilometry";
"Meters" = "Metry";
"Miles" = "Mile";
"Millimeters" = "Milimetry";
"Nautical Miles" = "Mile morskie";
"Points" = "Punkty";
"Yards" = "Jardy";

/* Area Units Abbreviated Strings */
"sq. in" = "sq in";
"sq. ft" = "sq ft";
"sq. yd" = "sq yd";
"ac" = "ac";
"sq. mi" = "sq mi";
"sq. mm" = "mm kw";
"sq. cm" = "cm kw";
"sq. dm" = "dm kw";
"sq. m" = "m kw";
"ares" = "ary";
"ha" = "ha";
"sq. km" = "km kw";

/* Area Units Display Strings */
"Square Inches" = "Cale kwadratowe";
"Square Feet" = "Stopy kwadratowe";
"Square Yards" = "Jardy kwadratowe";
"Acres" = "Akry";
"Square Miles" = "Mile kwadratowe";
"Square Millimeters" = "Milimetry kwadratowe";
"Square Centimeters" = "Centymetry kwadratowe";
"Square Decimeters" = "Decymetry kwadratowe";
"Square Meters" = "Metry kwadratowe";
"Ares" = "Ary";
"Hectares" = "Hektary";
"Square Kilometers" = "Kilometry kwadratowe";

/* Errors */
"Error" = "Błąd";
"Class not @protocol AGSJSONSerializable compliant" = "Klasa niezgodna z protokołem @protocol AGSJSONSerializable";
"Authorization required" = "Wymagana autoryzacja";
"Token is invalid or has expired" = "Niepoprawny lub nieaktualny token";
"Unknown error occurred" = "Wystąpił nieznany błąd";
"Empty username/password" = "Nie wpisano nazwy użytkownika/hasła";
"Token URL is nil. You must set a valid token URL on the credential." = "Brak adresu URL tokena. Należy podać prawidłowy adres URL tokena w poświadczeniu.";
"Unknown authentication error" = "Nieznany błąd uwierzytelniania";
"Error extracting identity" = "Błąd wydzielania tożsamości";
"Error adding identity to the keychain" = "Błąd dodawania tożsamości do łańcucha znaków";
"Invalid Credentials" = "Nieprawidłowe poświadczenia";
"Bad URL." = "Niepoprawny adres URL.";
"The feature layer does not expose an object-id field." = "Warstwa obiektów nie uwidacznia pola object-id.";
"Both geodatabase and syncParams are required for this method." = "Metoda wymaga użycia zarówno geobazy, jak i parametrów synchronizacji.";
"Uploading deltas is not supported with this replica." = "Replika nie obsługuje wczytywania przyrostów.";
"Error creating delta geodatabase" = "Błąd tworzenia geobazy z przyrostami";
"Unable to create result image layer" = "Nie można utworzyć rastrowej warstwy wynikowej";
"Cache at path '%@' not found." = "Pamięć podręczna pod ścieżką '%@' nie została odnaleziona.";
"To add an item, you must be logged in to the portal." = "Aby dodać element, należy zalogować się do portalu.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Aby dodać element, należy określić wartość w AGSPortalItemContentParameters.";
"The portal failed to add the item." = "Nie udało się dodać elementu z portalu.";
"To delete an item, you must be logged in to the portal." = "Aby usunąć element, należy zalogować się do portalu.";
"The portal failed to delete the item." = "Nie udało się usunąć elementu z portalu.";
"To update an item, an itemId and logged in user are required." = "Do aktualizacji elementu wymagane jest zalogowanie się oraz podanie parametru itemId.";
"The item failed to update." = "Nie udało się zaktualizować elementu.";
"The item failed to update JSON." = "Nie udało się zaktualizować JSON z elementu.";
"You must be logged in to a portal to add a comment." = "Aby dodać komentarz, należy zalogować się do portalu.";
"The comment failed to be added." = "Dodawanie komentarza nie powiodło się.";
"You must be logged in to a portal to fetch the current user's rating." = "Aby pobrać ocenę należy zalogować się do portalu.";
"You must be logged in to a portal to add a rating." = "Aby dodać ocenę, należy zalogować się do portalu.";
"The rating failed to be added." = "Dodawanie oceny nie powiodło się.";
"To share an item, you must be logged in to the portal." = "Aby udostępnić element, należy zalogować się do portalu.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Aby anulować udostępnianie elementu, należy zalogować się do portalu i określić grupy, w których element nie będzie już udostępniany.";
"Bad Request" = "Nieprawidłowe żądanie";
"Credential Required" = "Wymagane jest AGSCredential";
"Job not created" = "Zadanie nie zostało utworzone";
"Service did not return a valid URL" = "Usługa nie zwróciła poprawnego adresu URL";
"Service did not return a file" = "Usługa nie zwróciła pliku";
"Service did not return a size" = "Usługa nie zwróciła informacji o rozmiarze";
"Job failed" = "Zadanie nie powiodło się";
"Job timed out" = "Przekroczono limit czasu zadania";
"Job was cancelled" = "Zadanie zostało anulowane";
"Job was deleted" = "Zadanie zostało usunięte";
"Feature with objectId: %d not found" = "Nie odnaleziono obiektu o identyfikatorze: %d";
"No object-id values specified for feature table query." = "Nie podano identyfikatorów obiektów dla zapytania do tabeli obiektów.";

/* OAuth */
"The specified clientID is invalid" = "Podany identyfikator klienta (clientID) jest nieprawidłowy";

/* Sync */
"Upload is not supported with this service." = "Usługa nie obsługuje wczytywania.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Aby wywołać synchronizację, należy określić kierunek synchronizacji inny niż AGSGDBSyncDirectionNone.";